; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-4)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city13)
	(fuel-level plane1 fl5)
	(at plane2 city3)
	(fuel-level plane2 fl2)
	(at plane3 city12)
	(fuel-level plane3 fl3)
	(at person1 city16)
	(at person2 city4)
	(at person3 city14)
	(at person4 city18)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane1 city18)
	(at plane2 city15)
	(at person1 city19)
	(at person2 city0)
	(at person3 city0)
	(at person4 city15)
	))

)

; plan
1. (zoom plane2 city3 city15 fl2 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl2)
   added: (at plane2 city15) (fuel-level plane2 fl0)
   goals met: 1 of 6
2. (zoom plane1 city13 city14 fl5 fl4 fl3)
   deleted: (at plane1 city13) (fuel-level plane1 fl5)
   added: (at plane1 city14) (fuel-level plane1 fl3)
   goals met: 1 of 6
3. (zoom plane1 city14 city18 fl3 fl2 fl1)
   deleted: (at plane1 city14) (fuel-level plane1 fl3)
   added: (at plane1 city18) (fuel-level plane1 fl1)
   goals met: 2 of 6
4. (board person4 plane1 city18)
   deleted: (at person4 city18)
   added: (in person4 plane1)
   goals met: 2 of 6
5. (fly plane1 city18 city15 fl1 fl0)
   deleted: (at plane1 city18) (fuel-level plane1 fl1)
   added: (at plane1 city15) (fuel-level plane1 fl0)
   goals met: 1 of 6
6. (zoom plane3 city12 city14 fl3 fl2 fl1)
   deleted: (at plane3 city12) (fuel-level plane3 fl3)
   added: (at plane3 city14) (fuel-level plane3 fl1)
   goals met: 1 of 6
7. (board person3 plane3 city14)
   deleted: (at person3 city14)
   added: (in person3 plane3)
   goals met: 1 of 6
8. (refuel plane1 city15 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 1 of 6
9. (fly plane3 city14 city0 fl1 fl0)
   deleted: (at plane3 city14) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 1 of 6
10. (debark person3 plane3 city0)
   deleted: (in person3 plane3)
   added: (at person3 city0)
   goals met: 2 of 6
11. (debark person4 plane1 city15)
   deleted: (in person4 plane1)
   added: (at person4 city15)
   goals met: 3 of 6
12. (fly plane1 city15 city16 fl1 fl0)
   deleted: (at plane1 city15) (fuel-level plane1 fl1)
   added: (at plane1 city16) (fuel-level plane1 fl0)
   goals met: 3 of 6
13. (refuel plane3 city0 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 6
14. (refuel plane1 city16 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 3 of 6
15. (board person1 plane1 city16)
   deleted: (at person1 city16)
   added: (in person1 plane1)
   goals met: 3 of 6
16. (fly plane1 city16 city18 fl1 fl0)
   deleted: (at plane1 city16) (fuel-level plane1 fl1)
   added: (at plane1 city18) (fuel-level plane1 fl0)
   goals met: 4 of 6
17. (refuel plane1 city18 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 6
18. (fly plane3 city0 city4 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 4 of 6
19. (board person2 plane3 city4)
   deleted: (at person2 city4)
   added: (in person2 plane3)
   goals met: 4 of 6
20. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 4 of 6
21. (fly plane3 city4 city0 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city0) (fuel-level plane3 fl0)
   goals met: 4 of 6
22. (debark person2 plane3 city0)
   deleted: (in person2 plane3)
   added: (at person2 city0)
   goals met: 5 of 6
23. (fly plane1 city18 city19 fl1 fl0)
   deleted: (at plane1 city18) (fuel-level plane1 fl1)
   added: (at plane1 city19) (fuel-level plane1 fl0)
   goals met: 4 of 6
24. (refuel plane1 city19 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 4 of 6
25. (debark person1 plane1 city19)
   deleted: (in person1 plane1)
   added: (at person1 city19)
   goals met: 5 of 6
26. (fly plane1 city19 city18 fl1 fl0)
   deleted: (at plane1 city19) (fuel-level plane1 fl1)
   added: (at plane1 city18) (fuel-level plane1 fl0)
   goals met: 6 of 6
